devdnl/dnx-rtos/src/system/cpu/stm32f7/cpuctl.c
/*=========================================================================*//**
@file    cpuctl.c

@author  Daniel Zorychta

@brief   This file support CPU control

@note    Copyright (C) 2020 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the Free Software Foundation and modified by the dnx RTOS exception.

         NOTE: The modification  to the GPL is  included to allow you to
               distribute a combined work that includes dnx RTOS without
               being obliged to provide the source  code for proprietary
               components outside of the dnx RTOS.

         The dnx RTOS  is  distributed  in the hope  that  it will be useful,
         but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         Full license text is available on the following file: doc/license.txt.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "config.h"
#include "stm32f7/cpuctl.h"
#include "stm32f7/stm32f7xx.h"
#include "stm32f7/lib/stm32f7xx_ll_rcc.h"
#include "stm32f7/lib/misc.h"
#include "kernel/kwrapper.h"
#include "kernel/kpanic.h"
#include "kernel/sysfunc.h"

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
/* Cortex System Control register address */
#define SCB_SysCtrl             (*((__IO uint32_t *)0xE000ED10))
#define SysCtrl_SLEEPDEEP       ((uint32_t)0x00000004)

#define SRAM1_HEAP_START        ((void *)&__heap_start)
#define SRAM1_HEAP_SIZE         ((size_t)&__heap_size)

#define SRAM2_START             ((void *)&__ram2_start)
#define SRAM2_SIZE              ((size_t)&__ram2_size)

#define DTCM_START              ((void *)&__dtcm_start)
#define DTCM_SIZE               ((size_t)&__dtcm_size)

// Memory Management Fault Status Register
#define NVIC_MFSR               (*(volatile unsigned char*)(0xE000ED28u))

// Bus Fault Status Register
#define NVIC_BFSR               (*(volatile unsigned char*)(0xE000ED29u))

// Usage Fault Status Register
#define NVIC_UFSR               (*(volatile unsigned short*)(0xE000ED2Au))

// Hard Fault Status Register
#define NVIC_HFSR               (*(volatile unsigned int*)(0xE000ED2Cu))

// Debug Fault Status Register
#define NVIC_DFSR               (*(volatile unsigned int*)(0xE000ED30u))

// MemManage Fault Address Register
#define NVIC_MFAR               (*(volatile unsigned int*)(0xE000ED34u))

// Bus Fault Manage Address Register
#define NVIC_BFAR               (*(volatile unsigned int*)(0xE000ED38u))

// Auxiliary Fault Status Register
#define NVIC_AFSR               (*(volatile unsigned int*)(0xE000ED3Cu))

/*
 * MPU Definitions
 */
#define MPU_HFNMI_PRIVDEF_NONE          ((uint32_t)0x00000000U)
#define MPU_HARDFAULT_NMI               ((uint32_t)0x00000002U)
#define MPU_PRIVILEGED_DEFAULT          ((uint32_t)0x00000004U)
#define MPU_HFNMI_PRIVDEF               ((uint32_t)0x00000006U)

#define MPU_REGION_ENABLE               ((uint8_t)0x01U)
#define MPU_REGION_DISABLE              ((uint8_t)0x00U)

#define MPU_INSTRUCTION_ACCESS_ENABLE   ((uint8_t)0x00U)
#define MPU_INSTRUCTION_ACCESS_DISABLE  ((uint8_t)0x01U)

#define MPU_ACCESS_SHAREABLE            ((uint8_t)0x01U)
#define MPU_ACCESS_NOT_SHAREABLE        ((uint8_t)0x00U)

#define MPU_ACCESS_CACHEABLE            ((uint8_t)0x01U)
#define MPU_ACCESS_NOT_CACHEABLE        ((uint8_t)0x00U)

#define MPU_ACCESS_BUFFERABLE           ((uint8_t)0x01U)
#define MPU_ACCESS_NOT_BUFFERABLE       ((uint8_t)0x00U)

#define MPU_TEX_LEVEL0                  ((uint8_t)0x00U)
#define MPU_TEX_LEVEL1                  ((uint8_t)0x01U)
#define MPU_TEX_LEVEL2                  ((uint8_t)0x02U)

#define MPU_REGION_SIZE_32B             ((uint8_t)0x04U)
#define MPU_REGION_SIZE_64B             ((uint8_t)0x05U)
#define MPU_REGION_SIZE_128B            ((uint8_t)0x06U)
#define MPU_REGION_SIZE_256B            ((uint8_t)0x07U)
#define MPU_REGION_SIZE_512B            ((uint8_t)0x08U)
#define MPU_REGION_SIZE_1KiB            ((uint8_t)0x09U)
#define MPU_REGION_SIZE_2KiB            ((uint8_t)0x0AU)
#define MPU_REGION_SIZE_4KiB            ((uint8_t)0x0BU)
#define MPU_REGION_SIZE_8KiB            ((uint8_t)0x0CU)
#define MPU_REGION_SIZE_16KiB           ((uint8_t)0x0DU)
#define MPU_REGION_SIZE_32KiB           ((uint8_t)0x0EU)
#define MPU_REGION_SIZE_64KiB           ((uint8_t)0x0FU)
#define MPU_REGION_SIZE_128KiB          ((uint8_t)0x10U)
#define MPU_REGION_SIZE_256KiB          ((uint8_t)0x11U)
#define MPU_REGION_SIZE_512KiB          ((uint8_t)0x12U)
#define MPU_REGION_SIZE_1MiB            ((uint8_t)0x13U)
#define MPU_REGION_SIZE_2MiB            ((uint8_t)0x14U)
#define MPU_REGION_SIZE_4MiB            ((uint8_t)0x15U)
#define MPU_REGION_SIZE_8MiB            ((uint8_t)0x16U)
#define MPU_REGION_SIZE_16MiB           ((uint8_t)0x17U)
#define MPU_REGION_SIZE_32MiB           ((uint8_t)0x18U)
#define MPU_REGION_SIZE_64MiB           ((uint8_t)0x19U)
#define MPU_REGION_SIZE_128MiB          ((uint8_t)0x1AU)
#define MPU_REGION_SIZE_256MiB          ((uint8_t)0x1BU)
#define MPU_REGION_SIZE_512MiB          ((uint8_t)0x1CU)
#define MPU_REGION_SIZE_1GiB            ((uint8_t)0x1DU)
#define MPU_REGION_SIZE_2GiB            ((uint8_t)0x1EU)
#define MPU_REGION_SIZE_4GiB            ((uint8_t)0x1FU)

#define MPU_REGION_NO_ACCESS            ((uint8_t)0x00U)
#define MPU_REGION_PRIV_RW              ((uint8_t)0x01U)
#define MPU_REGION_PRIV_RW_URO          ((uint8_t)0x02U)
#define MPU_REGION_FULL_ACCESS          ((uint8_t)0x03U)
#define MPU_REGION_PRIV_RO              ((uint8_t)0x05U)
#define MPU_REGION_PRIV_RO_URO          ((uint8_t)0x06U)

#define MPU_REGION_NUMBER0              ((uint8_t)0x00U)
#define MPU_REGION_NUMBER1              ((uint8_t)0x01U)
#define MPU_REGION_NUMBER2              ((uint8_t)0x02U)
#define MPU_REGION_NUMBER3              ((uint8_t)0x03U)
#define MPU_REGION_NUMBER4              ((uint8_t)0x04U)
#define MPU_REGION_NUMBER5              ((uint8_t)0x05U)
#define MPU_REGION_NUMBER6              ((uint8_t)0x06U)
#define MPU_REGION_NUMBER7              ((uint8_t)0x07U)

/*==============================================================================
  Local types, enums definitions
==============================================================================*/
typedef struct {
        uint32_t R0;
        uint32_t R1;
        uint32_t R2;
        uint32_t R3;
        uint32_t R12;
        uint32_t LR;    // Link register.
        uint32_t PC;    // Program counter.
        uint32_t PSR;   // Program status register.
        uint32_t MFSR;  // Memory Management Fault Status Register.
        uint32_t BFSR;  // Bus Fault Status Register.
        uint32_t UFSR;  // Usage Fault Status Register.
        uint32_t HFSR;  // Hard Fault Status Register.
        uint32_t DFSR;  // Debug Fault Status Register.
        uint32_t BFAR;  // Bus Fault Manage Address Register.
        uint32_t AFSR;  // Auxiliary Fault Status Register.
        uint32_t MFAR;  // MemManage Fault Address Register
} reg_dump_t;

typedef struct
{
        uint8_t  enable;                /*!< Specifies the status of the region.*/
        uint8_t  number;                /*!< Specifies the number of the region to protect.*/
        uint32_t base_address;          /*!< Specifies the base address of the region to protect.*/
        uint8_t  size;                  /*!< Specifies the size of the region to protect.*/
        uint8_t  sub_region_disable;    /*!< Specifies the number of the subregion protection to disable.*/
        uint8_t  type_ext_field;        /*!< Specifies the TEX field level.*/
        uint8_t  access_permission;     /*!< Specifies the region access permission type.*/
        uint8_t  disable_exec;          /*!< Specifies the instruction access status.*/
        uint8_t  is_shareable;          /*!< Specifies the shareability status of the protected region.*/
        uint8_t  is_cacheable;          /*!< Specifies the cacheable status of the region protected.*/
        uint8_t  is_bufferable;         /*!< Specifies the bufferable status of the protected region.*/
} MPU_region_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
void get_registers_from_stack(uint32_t *stack_address);

#if __CPU_RAM1_RAM2_CACHE_DISABLE__ == _YES_
static void MPU_disable(void);
static void MPU_enable(uint32_t MPU_Control);
static void MPU_conf_region(MPU_region_t *mpu_region);
#endif

/*==============================================================================
  Local object definitions
==============================================================================*/
extern void *__heap_start;
extern void *__heap_size;
extern void *__ram2_start;
extern void *__ram2_size;
extern void *__dtcm_start;
extern void *__dtcm_size;

static _mm_region_t sram1;
static _mm_region_t sram2;
static _mm_region_t dtcm;

static volatile reg_dump_t reg_dump __attribute__ ((section (".noinit")));

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief  Basic (first) CPU/microcontroller configuration. This function is
 *         called before system start.
 *
 * @param  None
 *
 * @return None
 */
//==============================================================================
void _cpuctl_init(void)
{
        NVIC_SetVectorTable(NVIC_VectTab_FLASH, __CPU_VTOR_TAB_POSITION__);
        NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);

