devdnl/dnx-rtos/src/system/cpu/stm32f7/cpuctl.c
        /* enable FPU */
        SCB->CPACR |= ((3 << 20)|(3 << 22));

        #if __CPU_DISABLE_INTER_OF_MCYCLE_INSTR__ == _YES_
        /* disable interrupting multi-cycle instructions */
        SCnSCB->ACTLR |= SCnSCB_ACTLR_DISMCYCINT_Msk;
        #endif

        /* enable sleep on idle debug */
        SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_SLEEP);

        #if (__OS_MONITOR_CPU_LOAD__ > 0)
        _cpuctl_init_CPU_load_counter();
        #endif

        #if __CPU_RAM1_RAM2_CACHE_DISABLE__ == _YES_
        MPU_disable();
        MPU_region_t mpu;
        mpu.enable = MPU_REGION_ENABLE;
        mpu.access_permission = MPU_REGION_FULL_ACCESS;
        mpu.base_address = 0x20010000; // SRAM1 start
        mpu.disable_exec = MPU_INSTRUCTION_ACCESS_ENABLE;
        mpu.type_ext_field = MPU_TEX_LEVEL1;
        mpu.is_bufferable = MPU_ACCESS_NOT_BUFFERABLE;
        mpu.is_cacheable = MPU_ACCESS_NOT_CACHEABLE;
        mpu.is_shareable = MPU_ACCESS_SHAREABLE;
        mpu.number = MPU_REGION_NUMBER0;
        mpu.size = MPU_REGION_SIZE_512KiB;
        mpu.sub_region_disable = 0;
        MPU_conf_region(&mpu);
        MPU_enable(MPU_PRIVILEGED_DEFAULT);
        #endif

        u32_t ram1_ram2_flags = (__CPU_RAM1_RAM2_CACHE_DISABLE__ ? 0 : _MM_FLAG__CACHEABLE)
                              | _MM_FLAG__DMA_CAPABLE;

        _mm_register_region(&sram1, SRAM1_HEAP_START, SRAM1_HEAP_SIZE, ram1_ram2_flags, "SRAM1");
        _mm_register_region(&sram2, SRAM2_START, SRAM2_SIZE, ram1_ram2_flags, "SRAM2");
        _mm_register_region(&dtcm, DTCM_START, DTCM_SIZE, _MM_FLAG__DMA_CAPABLE, _CPUCTL_FAST_MEM);

        if (__CPU_ICACHE_ENABLE__) {
                _ISR_disable();
                SCB_InvalidateICache();
                SCB_EnableICache();
                _ISR_enable();
                printk("CPU: ICACHE enabled");
        }

        if (__CPU_DCACHE_ENABLE__) {
                _ISR_disable();
                SCB_InvalidateDCache();
                SCB_EnableDCache();
                _ISR_enable();
                printk("CPU: DCACHE enabled");
        }

        static const char *FPU_TYPE[] = {"none", "single", "double"};
        printk("CPU: FPU type %s", FPU_TYPE[SCB_GetFPUType()]);

#if __CPU_SHOW_AND_CLEAR_RESET_SOURCE__
        u32_t RSR = RCC->RSR;
        SET_BIT(RCC->RSR, RCC_RSR_RMVF);
        printk("Reset source:");
        if (RSR & RCC_RSR_LPWRRSTF)  printk("  Low power reset");
        if (RSR & RCC_RSR_WWDG1RSTF) printk("  Window watchdog reset");
        if (RSR & RCC_RSR_IWDG1RSTF) printk("  Watchdog reset");
        if (RSR & RCC_RSR_SFTRSTF)   printk("  Software reset");
        if (RSR & RCC_RSR_PORRSTF)   printk("  POR reset");
        if (RSR & RCC_RSR_PINRSTF)   printk("  Pin reset");
        if (RSR & RCC_RSR_BORRSTF)   printk("  BOR reset");
        if (RSR & RCC_RSR_D2RSTF)    printk("  D2 reset");
        if (RSR & RCC_RSR_D1RSTF)    printk("  D1 reset");
        if (RSR & RCC_RSR_CPURSTF)   printk("  CPU reset");
#endif
}

//==============================================================================
/**
 * @brief  This function restart CPU.
 */
//==============================================================================
void _cpuctl_restart_system(void)
{
        _cpuctl_clean_dcache();
        NVIC_SystemReset();
}

//==============================================================================
/**
 * @brief  This function restart CPU.
 */
//==============================================================================
void _cpuctl_shutdown_system(void)
{
        // Note: implementation enters to deep sleep mode.

        /* enable power module */
        RCC->APB1ENR |= RCC_APB1ENR_PWREN;

        /* Clear Wake-up flag */
        PWR->CR2 |= PWR_CR2_CWUPF1 | PWR_CR2_CWUPF2 | PWR_CR2_CWUPF3
                  | PWR_CR2_CWUPF4 | PWR_CR2_CWUPF5 | PWR_CR2_CWUPF6;

        /* Select STANDBY mode */
        PWR->CR1 |= PWR_CR1_PDDS;

        /* Set SLEEPDEEP bit of Cortex System Control Register */
        SCB_SysCtrl |= SysCtrl_SLEEPDEEP;

        /* Request Wait For Interrupt */
        __WFI();
}

//==============================================================================
/**
 * @brief  Start counter used for CPU load measurement. Timer should be set
 *         to at least 1MHz and should not overflow until 1 second.
 *
 * @param  None
 *
 * @return None
 */
//==============================================================================
#if (__OS_MONITOR_CPU_LOAD__ > 0)
void _cpuctl_init_CPU_load_counter(void)
{
}
#endif

//==============================================================================
/**
 * @brief  Function return valut that was counted from last call of this function.
 *         This function must reset timer after read. Function is called from
 *         IRQs.
 *
 * @param  None
 *
 * @return Timer value for last read (time delta).
 */
//==============================================================================
#if (__OS_MONITOR_CPU_LOAD__ > 0)
u32_t _cpuctl_get_CPU_load_counter_delta(void)
{
        static uint32_t last;
        bool  ovf = SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk;
        u32_t now = SysTick->VAL;

        u32_t delta;
        if (ovf) {
                delta = ((SysTick->LOAD + 1) - now) + last;
        } else {
                delta = last - now;
        }

        last = now;

        return delta;
}
#endif

//==============================================================================
/**
 * @brief  Function sleep CPU weakly. All IRQs must be able to wake up CPU.
 *
 * @param  None
 *
 * @return None
 */
//==============================================================================
void _cpuctl_sleep(void)
{
        __WFI();
}

//==============================================================================
/**
 * @brief  Function update all system clock after CPU frequency change.
 *         Function must update all devices which base on main clock oscillator.
 *         Function is called after clock/frequency change from clock management driver.
 *
 * @param  None
 *
 * @return None
 */
//==============================================================================
void _cpuctl_update_system_clocks(void)
{
        /* update CPU load timer frequency */
#if (__OS_MONITOR_CPU_LOAD__ > 0)
        _cpuctl_init_CPU_load_counter();
#endif

        /* update context switch counter frequency */
        _critical_section_begin();
        LL_RCC_ClocksTypeDef freq;
        LL_RCC_GetSystemClocksFreq(&freq);
        SysTick_Config((freq.HCLK_Frequency / (u32_t)__OS_TASK_SCHED_FREQ__) - 1);
        _critical_section_end();
}

//==============================================================================
/**
 * @brief  Function delay code processing in microseconds.
 *
 * @note   Function should block CPU for specified amount of time.
 * @note   Function should work in critical section and interrupts.
 *
 * @param  microseconds         microsecond delay
 */
//==============================================================================
void _cpuctl_delay_us(u16_t microseconds)
{
        u32_t ticks = ((u64_t)microseconds * SysTick->LOAD * __OS_TASK_SCHED_FREQ__) / 1000000;

