devdnl/dnx-rtos/src/system/cpu/stm32f7/cpuctl.c
        while (ticks > 0) {
                i32_t now = SysTick->VAL;

                if (now - ticks > 0) {
                        while (SysTick->VAL > (u32_t)(now - ticks));
                        ticks = 0;
                } else {
                        while (SysTick->VAL <= (u32_t)now);
                        ticks -= now;
                }
        }
}

//==============================================================================
/**
 * @brief  Function printout dumped registers.
 */
//==============================================================================
void _cpuctl_print_exception(void)
{
        printk("R0   : %08xh\n", reg_dump.R0);
        printk("R1   : %08xh\n", reg_dump.R1);
        printk("R2   : %08xh\n", reg_dump.R2);
        printk("R3   : %08xh\n", reg_dump.R3);
        printk("R12  : %08xh\n", reg_dump.R12);
        printk("LR   : %08xh\n", reg_dump.LR);
        printk("PC   : %08xh\n", reg_dump.PC);
        printk("PSR  : %08xh\n", reg_dump.PSR);
        printk("MFSR : %08xh\n", reg_dump.MFSR);
        printk("BFSR : %08xh\n", reg_dump.BFSR);
        printk("UFSR : %08xh\n", reg_dump.UFSR);
        printk("HFSR : %08xh\n", reg_dump.HFSR);
        printk("DFSR : %08xh\n", reg_dump.DFSR);
        printk("BFAR : %08xh\n", reg_dump.BFAR);
        printk("AFSR : %08xh\n", reg_dump.AFSR);
        printk("MFAR : %08xh\n", reg_dump.MFAR);
}

//==============================================================================
/**
 * @brief Hard Fault ISR
 */
//==============================================================================
void HardFault_Handler(void)
{
        __asm volatile
        (
                " tst lr, #4                                                \n"
                " ite eq                                                    \n"
                " mrseq r0, msp                                             \n"
                " mrsne r0, psp                                             \n"
                " ldr r1, [r0, #24]                                         \n"
                " b get_registers_from_stack                                \n"
        );
}

//==============================================================================
/**
 * @brief Memory Management failure ISR
 */
//==============================================================================
void MemManage_Handler(void)
{
        _kernel_panic_report_from_ISR(_KERNEL_PANIC_DESC_CAUSE_CPUFAULT);
}

//==============================================================================
/**
 * @brief Bus Fault ISR
 */
//==============================================================================
void BusFault_Handler(void)
{
        _kernel_panic_report_from_ISR(_KERNEL_PANIC_DESC_CAUSE_CPUFAULT);
}

//==============================================================================
/**
 * @brief Usage Fault ISR
 */
//==============================================================================
void UsageFault_Handler(void)
{
        _kernel_panic_report_from_ISR(_KERNEL_PANIC_DESC_CAUSE_CPUFAULT);
}

//==============================================================================
/**
 * @brief  Function dump registers stored in stack.
 *
 * @param  stack_address        stack address
 */
//==============================================================================
void get_registers_from_stack(uint32_t *stack_address)
{
        reg_dump.R0   = stack_address[0];
        reg_dump.R1   = stack_address[1];
        reg_dump.R2   = stack_address[2];
        reg_dump.R3   = stack_address[3];
        reg_dump.R12  = stack_address[4];
        reg_dump.LR   = stack_address[5];
        reg_dump.PC   = stack_address[6];
        reg_dump.PSR  = stack_address[7];
        reg_dump.MFSR = NVIC_MFSR;
        reg_dump.BFSR = NVIC_BFSR;
        reg_dump.UFSR = NVIC_UFSR;
        reg_dump.HFSR = NVIC_HFSR;
        reg_dump.DFSR = NVIC_DFSR;
        reg_dump.BFAR = NVIC_BFAR;
        reg_dump.AFSR = NVIC_AFSR;
        reg_dump.MFAR = NVIC_MFAR;

        _kernel_panic_report_from_ISR(_KERNEL_PANIC_DESC_CAUSE_SEGFAULT);
}

//==============================================================================
/**
 * @brief  Function clean/flush DCACHE.
 */
//==============================================================================
void _cpuctl_clean_dcache(void)
{
#if __DCACHE_PRESENT && __CPU_DCACHE_ENABLE__ && !__CPU_RAM1_RAM2_CACHE_DISABLE__
       SCB_CleanDCache();
#endif
}

//==============================================================================
/**
 * @brief  Function clean/flush and invalidate/reset DCACHE.
 */
//==============================================================================
void _cpuctl_clean_invalidate_dcache(void)
{
#if __DCACHE_PRESENT && __CPU_DCACHE_ENABLE__ && !__CPU_RAM1_RAM2_CACHE_DISABLE__
        SCB_CleanInvalidateDCache();
#endif
}

//==============================================================================
/**
 * @brief  Function invalidate/reset DCACHE.
 */
//==============================================================================
void _cpuctl_invalidate_dcache(void)
{
#if __DCACHE_PRESENT && __CPU_DCACHE_ENABLE__ && !__CPU_RAM1_RAM2_CACHE_DISABLE__
        SCB_InvalidateDCache();
#endif
}

//==============================================================================
/**
 * @brief  Function invalidate/reset DCACHE by address.
 *
 * @param  addr         address (must be aligned to 32 bytes)
 * @param  size         size in bytes
 */
//==============================================================================
void _cpuctl_invalidate_dcache_by_addr(void *addr, u32_t size)
{
#if __DCACHE_PRESENT && __CPU_DCACHE_ENABLE__ && !__CPU_RAM1_RAM2_CACHE_DISABLE__
        SCB_InvalidateDCache_by_Addr(addr, size);
#else
        (void)addr;
        (void)size;
#endif
}

//==============================================================================
/**
 * @brief  Function clean/flush DCACHE by address.
 *
 * @param  addr         address (must be aligned to 32 bytes)
 * @param  size         size in bytes
 */
//==============================================================================
void _cpuctl_clean_dcache_by_addr(void *addr, u32_t size)
{
#if __DCACHE_PRESENT && __CPU_DCACHE_ENABLE__ && !__CPU_RAM1_RAM2_CACHE_DISABLE__
        SCB_CleanDCache_by_Addr(addr, size);
#else
        (void)addr;
        (void)size;
#endif
}

//==============================================================================
/**
 * @brief  Function clean/flush and invalidate/reset DCACHE by address.
 *
 * @param  addr         address (must be aligned to 32 bytes)
 * @param  size         size in bytes
 */
//==============================================================================
void _cpuctl_clean_invalidate_dcache_by_addr(void *addr, u32_t size)
{
#if __DCACHE_PRESENT && __CPU_DCACHE_ENABLE__ && !__CPU_RAM1_RAM2_CACHE_DISABLE__
        SCB_CleanInvalidateDCache_by_Addr(addr, size);
#else
        (void)addr;
        (void)size;
#endif
}

#if __CPU_RAM1_RAM2_CACHE_DISABLE__ == _YES_
//==============================================================================
/**
 * @brief  Disables the MPU
 */
//==============================================================================
static void MPU_disable(void)
{
        /* Make sure outstanding transfers are done */
        __DMB();

