devdnl/dnx-rtos/src/system/cpu/stm32f7/cpuctl.c
        /* Disable fault exceptions */
        SCB->SHCSR &= ~SCB_SHCSR_MEMFAULTENA_Msk;

        /* Disable the MPU and clear the control register*/
        MPU->CTRL = 0;
}

//==============================================================================
/**
 * @brief  Enables the MPU
 * @param  MPU_Control Specifies the control mode of the MPU during hard fault,
 *         NMI, FAULTMASK and privileged access to the default memory
 *         This parameter can be one of the following values:
 *         @arg MPU_HFNMI_PRIVDEF_NONE
 *         @arg MPU_HARDFAULT_NMI
 *         @arg MPU_PRIVILEGED_DEFAULT
 *         @arg MPU_HFNMI_PRIVDEF
 * @retval None
 */
//==============================================================================
static void MPU_enable(uint32_t MPU_Control)
{
        /* Enable the MPU */
        MPU->CTRL = MPU_Control | MPU_CTRL_ENABLE_Msk;

        /* Enable fault exceptions */
        SCB->SHCSR |= SCB_SHCSR_MEMFAULTENA_Msk;

        /* Ensure MPU setting take effects */
        __DSB();
        __ISB();
}

//==============================================================================
/**
 * @brief  Initializes and configures the Region and the memory to be protected.
 * @param  MPU_Init Pointer to a MPU_Region_InitTypeDef structure that contains
 *                the initialization and configuration information.
 */
//==============================================================================
static void MPU_conf_region(MPU_region_t *mpu_region)
{
        MPU->RNR = mpu_region->number;

        if (mpu_region->enable) {
                MPU->RBAR = mpu_region->base_address;
                MPU->RASR = ((uint32_t)mpu_region->disable_exec << MPU_RASR_XN_Pos)
                          | ((uint32_t)mpu_region->access_permission << MPU_RASR_AP_Pos)
                          | ((uint32_t)mpu_region->type_ext_field << MPU_RASR_TEX_Pos)
                          | ((uint32_t)mpu_region->is_shareable << MPU_RASR_S_Pos)
                          | ((uint32_t)mpu_region->is_cacheable << MPU_RASR_C_Pos)
                          | ((uint32_t)mpu_region->is_bufferable << MPU_RASR_B_Pos)
                          | ((uint32_t)mpu_region->sub_region_disable << MPU_RASR_SRD_Pos)
                          | ((uint32_t)mpu_region->size << MPU_RASR_SIZE_Pos)
                          | ((uint32_t)mpu_region->enable << MPU_RASR_ENABLE_Pos);
        } else {
                MPU->RBAR = 0x00;
                MPU->RASR = 0x00;
        }
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
